
import streamlit as st
from st_pages import Page, show_pages, add_page_title
from annotated_text import annotated_text


st.set_page_config(
        page_title="هتل ساحل طلایی",
        page_icon="logo.png",
    )

with open("c.css") as f:
    st.markdown(f"<style> {f.read()} </style>", unsafe_allow_html=True)

st.snow()
st.image("logo.png")


col1,col2 = st.columns(2)

with col1:
    st.header("هتل ساحل طلایی قشم")
        
annotated_text(
    "هتل ساحل طلایی در 11 کیلومتری قشم است. ",
    ("هتل ساحل طلایی از همه نظر هتلی بی‌نظیر در قشم است و طیف گسترده‌ای از خدمات و امکانات را در اختیار مسافران قرار می‌دهد.", "این هتل قبل‌ها به ساحل سیمین یا پلاژ سیمین معروف بوده. "),
    ( "هتل ساحل طلایی  چند نوع واحد اقامتی دارد: سوئیت و اتاق معمولی،سوئیتهای وی آی پی، دوبلکس دوطبقه   هم دارند.","ساحل اختصاصی هتل بسیار تمیز و خلوت است  علاوه بر این‌ها مسافران می‌توانند لذت ماهیگیری  را در اسکله‌ی تفریحی هتل تجربه کنند."),
        ("هتل ساحل طلایی در جاده‌ی ساحلی جنوبی و در کنار زیارتگاه شاه شهید واقع شده. این هتل کمتر از ۲۰ دقیقه با یکی از جاذبه‌های شگفت‌انگیز قشم فاصله دارد.","رستوران ساحلی دوطبقه با نمای رو به دریا و آلاچیق‌های چوبی کنار ساحل همواره برای مسافران خاطرات خوشی رقم زده."),
("اقامت در هتل ساحل طلایی و بازدید از این نقاط دیدنی می‌تواند بدل به یکی از بهترین تجربیات مسافران قشم شود.","دره‌ی ستاره‌ها با قدمتی دو میلیون ساله، یکی از جاذبه‌های طبیعی قشم است که صحبت از آن همیشه با داستان‌ها و گاهی خرافه‌های جالبی همراه بوده."),
)

with col2:
    st.image("https://www.eghamat24.com/app/public/new_images/600x460/Qeshm-SahelTalaee-55.jpg")






show_pages(
    
    [
        
        Page("Hello.py", "صفحه اصلی", "🏠"),
        Page("page/sahel.py", "ساحل", "🌊"),
        Page("page/res.py", "رستوران", "👨🏻‍🍳"),
        Page("page/room.py", "اتاق ها", "⛪️"),
        Page("page/cafe.py", "کافی شاب", "🍫"),
        Page("page/marasem.py", "مراسمات", "🌈"),
    ]
    
)
