import streamlit as st

with open("c.css") as f:
  st.markdown(f"<style> {f.read()} </style>", unsafe_allow_html=True)



option = st.radio(
  """
  روی گزینه سوالات کلیک کنید
  """
  ,
  ("""اتاق ها رو به دریا هستند ؟ 🏠""",
   """آیا پارکینگ دارد ؟ 🅿️""",
   """رستوران چه ساعتی باز میشه ؟ 👨🏽‍🍳""",
   """کافی شاپ چه ساعتی باز میشه ؟ ☕""",
   """آیا آلاچیق هم وجود دارد ؟ 🛖""",
   """تور گردشگری هم دارید ؟ 🚕""",
   """آدرس هتل شما کجاست ؟ 📍""",
   """اتاق ها چند خوابه هستند ؟ ⛪️""",
  
  )
)

st.divider()
# Display the selected option
if option == "اتاق ها رو به دریا هستند ؟ 🏠":
  st.write("""
  بله ! تمامی اتاق ها رو به دریا هستند 🏠
  """)


elif option == "آیا پارکینگ دارد ؟ 🅿️":
  st.write("بله ! پارکینگ وجود دارد 🅿️")



elif option == "رستوران چه ساعتی باز میشه ؟ 👨🏽‍🍳":
  st.write("""
            👨🏽‍🍳
  رستوران برای صبحانه 8 الی 9:30
  و برای ناهار ساعت 13 الی 15:30
  و برای شام 20:30 الی 23:00
  باز است

  """)

elif option == "کافی شاپ چه ساعتی باز میشه ؟ ☕":
  st.write("""
   کافی شاپ صبح 11 الی 13 باز است و عصر از ساعت 16 الی 23 باز است ☕
  """)


elif option == "آیا آلاچیق هم وجود دارد ؟ 🛖":
  st.write("بله آلاچیق های کولردار و بدون کولر لب ساحل قرار دارد که میتونید صدای امواج دریا را گوش کنید 🛖")


elif option == "تور گردشگری هم دارید ؟ 🚕":
  st.write("بله , تور گردشگری داریم 🚕")

elif option == "آدرس هتل شما کجاست ؟ 📍":
  st.write("""
  جزیره قشم - جاده ساحل جنوبی , رمچاه ( روبروی زیارتگاه شاه شهید و غار خربس ) 📍
  هتل ساحل طلایی قشم

  """)



elif option == "اتاق ها چند خوابه هستند ؟ ⛪️":
  st.write("""
  ⛪️  این هتل دارای { اتاق های یک خوابه 4 تخته ,  اتاق های 3 تخته , دو خوابه 6 تخته , یک خوابه 5 تخته , دوبلکس 8 تخته , دوبلکس 6 تخته } ⛪️
""")












st.markdown("""
<style> 
#MainMenu {visibility: hidden;}
footer {visibility: hidden;}
</style>
""",unsafe_allow_html=True)